app/Http/Controllers/Admin/Backend/OrderController.php

SELECT * FROM `cart_orders` WHERE `order_status` = 'pending'
---
    public function pendingList()
    {
        $pending_orders = CartOrder::where('order_status', 'pending')->get();

SELECT * FROM `cart_orders` WHERE `order_status` = 'processing'
---
    public function processingList()
    {
        $processing_orders = CartOrder::where('order_status', 'pending')->get();

SELECT * FROM `cart_orders` WHERE `order_status` = 'purchased'
---
    public function purchasedList()
    {
        $purchased_orders = CartOrder::where('order_status', 'purchased')->get();