app/Http/Controllers/Admin/Backend/ProductController.php

SELECT * FROM `product_lists` ORDER BY `created_at` DESC
---
    public function index()
    {
        $products = ProductList::latest()->get();

SELECT * FROM `categories` ORDER BY `created_at` DESC
SELECT * FROM `subcategories` ORDER BY `created_at` DESC
---
    public function create()
    {
        $category = Category::latest()->get();
        $subcategory = Subcategory::latest()->get();

INSERT INTO `product_lists` (`title`, `price`, `special_price`, `image`, `category`, `sub_category`, `remark`, `brand`, `product_code`, `updated_at`, `created_at`) VALUES ('Lenovo x1', '25689.5', '25500', 'http://localhost:8000/storage/product_thumbnails/2023030809336408568514a7ami-notebook-horizon-edition-1-1591862096.jpg', 'Speakers', 'Lenovo', 'NEW', 'OPPO', '12123123678', '2023-03-08 09:33:57', '2023-03-08 09:33:57')
---
    public function store(AddProductRequest $request)
    {
        if ($request->hasFile('image')) {
            $image_name = date('YmdHi') . uniqid() . $request->file('image')->getClientOriginalName();
            $thumbnail_url = 'http://localhost:8000/storage/product_thumbnails/' . $image_name;
            Image::make($request->file('image'))->resize(350, 350)
                ->save(public_path('storage/product_thumbnails/') . $image_name);
        }
        if ($request->hasFile('sub_images')) {
            foreach ($request->file('sub_images') as $key => $file) {
                $image_name = date('YmdHi') . uniqid() . $file->getClientOriginalName();
                $url[] = 'http://localhost:8000/storage/images/' . $image_name;
                Image::make($file)->resize(280, 280)
                    ->save(public_path('storage/images/') . $image_name);
            }
        }

        $product_list = [
            'title' => $request->title,
            'price' => $request->price,
            'special_price' => $request->special_price,
            'image' => $thumbnail_url,
            'category' => $request->category,
            'sub_category' => $request->sub_category,
            'remark' => $request->remark,
            'brand' => $request->brand,
            'product_code' => $request->product_code,
        ];

        //add product list
        $add_product_list = ProductList::create($product_list);

INSERT INTO `product_details` (`product_id`, `image_one`, `image_two`, `image_three`, `image_four`, `short_description`, `long_description`, `color`, `size`, `updated_at`, `created_at`) VALUES (28, 'http://localhost:8000/storage/images/20230308123364088081ea250811QpiYXe-L._AC_SL1500_.jpg', 'http://localhost:8000/storage/images/20230308123364088082445a071IGKyL5DhL._SL1500_.jpg', , , 'Lorem ipsum dolor sit amet consectetur adipisicing elit. Nihil doloribus molestias sunt assumenda, voluptas saepe suscipit aperiam ullam rem! Quas quo asperi', '<p>Lorem ipsum dolor sit amet consectetur adipisicing elit. Nihil doloribus molestias sunt assumenda, voluptas saepe suscipit aperiam ullam rem! Quas quo asperiLorem ipsum dolor sit amet consectetur adipisicing elit. Nihil doloribus molestias sunt assumenda, voluptas saepe suscipit aperiam ullam rem! Quas quo asperiLorem ipsum dolor sit amet consectetur adipisicing elit. Nihil doloribus molestias sunt assumenda, voluptas saepe suscipit aperiam ullam rem! Quas quo asperiLorem ipsum dolor sit amet consectetur adipisicing elit. Nihil doloribus molestias sunt assumenda, voluptas saepe suscipit aperiam ullam rem! Quas quo asperiLorem ipsum dolor sit amet consectetur adipisicing elit. Nihil doloribus molestias sunt assumenda, voluptas saepe suscipit aperiam ullam rem! Quas quo asperi</p>', 'Red, Black', 'Small', '2023-03-08 12:33:06', '2023-03-08 12:33:06')
---
            ];

            //add product details
            $add_product_details = ProductDetails::create($product_details);

SELECT * FROM `product_details` WHERE `product_id` = 24 LIMIT 1
---
    public function show(ProductList $product)
    {
        $product_details = ProductDetails::where('product_id', $product->id)->first();

SELECT `category_name` FROM `categories` ORDER BY `created_at` DESC
SELECT `subcategory_name` FROM `subcategories` ORDER BY `created_at` DESC
SELECT * FROM `product_details` WHERE `product_id` = 22 LIMIT 1
SELECT * FROM `subcategories` ORDER BY `created_at` DESC
SELECT * FROM `categories` ORDER BY `created_at` DESC
---
    public function edit(ProductList $product)
    {
        $category = Category::latest()->select(['category_name'])->get();
        $subcategory = Subcategory::latest()->select(['subcategory_name'])->get();
        $product_details = ProductDetails::where('product_id', $product->id)->first();
        $product_info = [
            'id' => $product->id,
            'product_details_id' => $product_details->id,
            'title' => $product->title,
            'price' => $product->price,
            'special_price' => $product->special_price,
            'category' => $product->category,
            'sub_category' => $product->sub_category,
            'remark' => $product->remark,
            'brand' => $product->brand,
            'rating' => $product->rating,
            'product_code' => $product->product_code,
            'image_one' =>  $product_details->image_one ? $product_details->image_one : null,
            'image_two' =>  $product_details->image_two ? $product_details->image_two : null,
            'image_three' =>  $product_details->image_three ? $product_details->image_three : null,
            'image_four' =>  $product_details->image_four ? $product_details->image_four : null,
            'short_description' =>  $product_details->short_description,
            'long_description' =>  $product_details->long_description,
            'color' =>  $product_details->color,
            'size' =>  $product_details->size,
        ];

SELECT * FROM `product_details` WHERE `product_id` = 22 LIMIT 1
---
    public function update(Request $request, ProductList $product)
    {

        $productDetail = ProductDetails::where('product_id', $product->id)->first();

SELECT * FROM `product_details` WHERE `product_id` = 24 LIMIT 1
DELETE FROM `product_details` WHERE `id` = 17
---
    public function destroy(ProductList $product)
    {
        $productDetail = ProductDetails::where('product_id', $product->id)->first();
        $product_delete = $product->delete();

        //Seperate image name from the url
        $stored_image_name = Str::after($product->image, "http://localhost:8000/storage/product_thumbnails/");
        unlink(public_path('storage/product_thumbnails/') . $stored_image_name);

        if ($productDetail && $product_delete)
            $existing_image_path = [
                'first_image' => $productDetail->image_one ? Str::after($productDetail->image_one, "http://localhost:8000/storage/images/") : null,
                'second_image' => $productDetail->image_two ? Str::after($productDetail->image_two, "http://localhost:8000/storage/images/") : null,
                'third_image' => $productDetail->image_three ? Str::after($productDetail->image_three, "http://localhost:8000/storage/images/") : null,
            ];

        $existing_image_path['first_image'] != null ? unlink(public_path('storage/images/') .  $existing_image_path['first_image']) : null;
        $existing_image_path['second_image'] != null ? unlink(public_path('storage/images/') .  $existing_image_path['second_image']) : null;
        $existing_image_path['third_image'] != null ? unlink(public_path('storage/images/') .  $existing_image_path['third_image']) : null;


        $product_details_delete = $productDetail->delete();