app/Http/Controllers/Admin/Backend/SliderController.php

    public function index()
    {
        $slides = HomeSlider::latest()->paginate(7);
---
SELECT * FROM `home_sliders` ORDER BY `created_at` DESC LIMIT 7 offset 0
SELECT count(*) as aggregate FROM `home_sliders`

    public function destroy(HomeSlider $slider)
    {
        $existing_image_path = explode("http://localhost:8000/storage/slider_image/", $slider->slider_image);
        $stored_image_name = $existing_image_path[1];

        $deleted = $slider->delete();
---
DELETE FROM `home_sliders` WHERE `id` = 26