app/Http/Controllers/Admin/Backend/SubCategoryController.php

    public function index(): View
    {
        $sub_categories = $this->subcategoryModel->latest()->get();
---
SELECT * FROM `subcategories` ORDER BY `created_at` DESC
SELECT * FROM `categories`