app/Http/Controllers/Admin/CategoryController.php

SELECT * FROM `categories` ORDER BY `created_at` DESC
---
    public function getAllCategory()
    {
        $category = $this->categoryModel->latest()->get();